# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
network = input("Введите сеть в формате 10.0.0.1/24:")
network = network.split("/")
octets = network[0].split(".")
output = """
Network:
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}
"""
print(output.format(int(octets[0]), int(octets[1]), int(octets[2]), int(octets[3])))
output_temp = """{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}
"""
print ("Mask:\n"+"/"+network[1])
mask = "1" * int(network[1]) + "0" * (32 - int(network[1]))
print(output_temp.format(int(mask[:8],2), int(mask[8:16],2), int(mask[16:24],2), int(mask[24:32],2)))


